Tekla.Structures.Model.Assembly
The Assembly class defines a single manufacturing unit: objects that are bolted or welded together in the workshop.
An assembly has a main part and secondary assemblables attached to it. The number of secondaries is limited to 2048.
Hierarchical assemblies can also have subassemblies attached to them and they can have a parent assembly instance.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
public void Example1()
{
Beam B1 = new Beam(new Point(0,0,0), new Point(1000,0,0));
Beam B2 = new Beam(new Point(0,0,0), new Point(0,0,1000));
B1.Profile.ProfileString = "380*380";
B1.Material.MaterialString = "K40-1";
B2.Profile.ProfileString = "380*380";
B2.Material.MaterialString = "K40-1";
B1.Insert();
B2.Insert();
Assembly A = B1.GetAssembly();
A.Add(B2);
if(!A.Modify())
Console.WriteLine("Assembly Modify Failed!");
}
}